GeFengthe/RTL8762/src/app/mesh/ali_fan_light/light_app.c
    switch (cb_type)
    {
    case PROV_CB_TYPE_PB_ADV_LINK_STATE:
        switch (cb_data.pb_generic_cb_type)
        {
        case PB_GENERIC_CB_LINK_OPENED:
            if (mesh_node.node_state == UNPROV_DEVICE)
            {
                light_prov_link_open();
            }
            break;
        case PB_GENERIC_CB_LINK_OPEN_FAILED:
            break;
        case PB_GENERIC_CB_LINK_CLOSED:
            if (mesh_node.node_state == UNPROV_DEVICE)
            {
                light_prov_link_closed();
            }
            break;
        default:
            break;
        }
        break;
    case PROV_CB_TYPE_UNPROV:
        unprov_timer_init();
        light_prov_unprov();
        break;
    case PROV_CB_TYPE_START:
        light_prov_start();
        break;
    case PROV_CB_TYPE_PUBLIC_KEY:
        {
            uint8_t public_key[64] = {0xf4, 0x65, 0xe4, 0x3f, 0xf2, 0x3d, 0x3f, 0x1b, 0x9d, 0xc7, 0xdf, 0xc0, 0x4d, 0xa8, 0x75, 0x81, 0x84, 0xdb, 0xc9, 0x66, 0x20, 0x47, 0x96, 0xec, 0xcf, 0x0d, 0x6c, 0xf5, 0xe1, 0x65, 0x00, 0xcc, 0x02, 0x01, 0xd0, 0x48, 0xbc, 0xbb, 0xd8, 0x99, 0xee, 0xef, 0xc4, 0x24, 0x16, 0x4e, 0x33, 0xc2, 0x01, 0xc2, 0xb0, 0x10, 0xca, 0x6b, 0x4d, 0x43, 0xa8, 0xa1, 0x55, 0xca, 0xd8, 0xec, 0xb2, 0x79};
            uint8_t private_key[32] = {0x52, 0x9a, 0xa0, 0x67, 0x0d, 0x72, 0xcd, 0x64, 0x97, 0x50, 0x2e, 0xd4, 0x73, 0x50, 0x2b, 0x03, 0x7e, 0x88, 0x03, 0xb5, 0xc6, 0x08, 0x29, 0xa5, 0xa3, 0xca, 0xa2, 0x19, 0x50, 0x55, 0x30, 0xba};
            prov_params_set(PROV_PARAMS_PUBLIC_KEY, public_key, sizeof(public_key));
            prov_params_set(PROV_PARAMS_PRIVATE_KEY, private_key, sizeof(private_key));
            APP_PRINT_INFO0("prov_cb: Please show the public key to the provisioner");
        }
        break;
    case PROV_CB_TYPE_AUTH_DATA:
        {
            prov_start_p pprov_start = cb_data.pprov_start;
            char secret[32];
            uint32_t product_id;
            if (user_data_contains_ali_data())
            {
                user_data_read_ali_secret_key((uint8_t *)secret);
                product_id = user_data_read_ali_product_id();
            }
            else
            {
                memcpy(secret, ALI_SECRET_KEY, 32);
                product_id = ALI_PRODUCT_ID;
            }
            char data[8 + 1 + 12 + 1 + 32 + 1];
            uint8_t auth_data[SHA256_DIGEST_LENGTH]; // Only use 16 bytes
            sprintf(data, "%08x", product_id);
            data[8] = ',';
            uint8_t bt_addr[6];
            gap_get_param(GAP_PARAM_BD_ADDR, bt_addr);
            sprintf(data + 9, "%02x%02x%02x%02x%02x%02x", bt_addr[5], bt_addr[4], bt_addr[3], bt_addr[2],
                    bt_addr[1], bt_addr[0]);
            data[21] = ',';
            memcpy(data + 22, secret, 32);
            data[54] = 0; // for log print debug
            /*
             * sample: product id = 0x293e2, bt addr = AB:CD:F0:F1:F2:F3, secret = "atFY1tGDCo4MQSVCGVDqtti3PvBI5WXb"
             * input: "000293e2,abcdf0f1f2f3,atFY1tGDCo4MQSVCGVDqtti3PvBI5WXb"
             * ouput: 8e-e2-17-bc-02-a5-ab-66-6d-d2-ce-39-5d-f7-20-55-85-4a-f2-7e-c5-c0-45-d9-2a-48-48-99-74-3a-dc-9f
             * authvalue: 8e-e2-17-bc-02-a5-ab-66-6d-d2-ce-39-5d-f7-20-55
             */
            printi("sha256 input: %s", TRACE_STRING(data));
            SHA256_CTX sha_ctx;
            SHA256_Init(&sha_ctx);
            SHA256_Update(&sha_ctx, data, sizeof(data) - 1);
            SHA256_Final(&sha_ctx, auth_data);
            printi("sha256 output: %b", TRACE_BINARY(SHA256_DIGEST_LENGTH, auth_data));
            switch (pprov_start->auth_method)
            {
            case PROV_AUTH_METHOD_STATIC_OOB:
                prov_auth_value_set(auth_data, 16);
                APP_PRINT_ERROR1("prov_cb: Please exchange the oob data(%b) with the provisioner", TRACE_BINARY(16,
                                 auth_data));
                break;
            case PROV_AUTH_METHOD_OUTPUT_OOB:
                //prov_auth_value_set(auth_data, pprov_start->auth_size.output_oob_size);
                APP_PRINT_INFO2("prov_cb: Please output the oob data to the provisioner, output size = %d, action = %d",
                                pprov_start->auth_size.output_oob_size, pprov_start->auth_action.output_oob_action);
                break;
            case PROV_AUTH_METHOD_INPUT_OOB:
                //prov_auth_value_set(auth_data, pprov_start->auth_size.input_oob_size);
                APP_PRINT_INFO2("prov_cb: Please input the oob data provided by the provisioner, input size = %d, action = %d",
                                pprov_start->auth_size.input_oob_size, pprov_start->auth_action.input_oob_action);
                break;
            default:
                break;
            }
        }
        break;
    case PROV_CB_TYPE_COMPLETE:
        {
#include "dfu_updater_app.h"
#if DFU_UPDATER_SUPPORT_POWER_OFF_GO_ON
            dfu_updater_clear();
#endif
            light_prov_complete();
            mesh_model_bind_all_key();
            light_ctl_server_models_sub();
            fan_server_models_sub();
        }
        break;
    case PROV_CB_TYPE_FAIL:
        //light_lighten_green();
        break;
    case PROV_CB_TYPE_PROV:
        /* stack ready */
        break;
    default:
        break;
    }
    return true;
}

void fn_cb(uint8_t frnd_index, fn_cb_type_t type, uint16_t lpn_addr)
{
    char *string[] = {"establishing with lpn 0x%04x\r\n", "no poll from 0x%04x\r\n", "established with lpn 0x%04x\r\n", "lpn 0x%04x lost\r\n"};
    data_uart_debug(string[type], lpn_addr);
}
